espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of evt_st3 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** mcpwm0_evt_op2_tea_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MCPWM0_evt_op2_tea trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op2_tea_st:1;
        /** mcpwm0_evt_op0_teb_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents MCPWM0_evt_op0_teb trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op0_teb_st:1;
        /** mcpwm0_evt_op1_teb_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents MCPWM0_evt_op1_teb trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op1_teb_st:1;
        /** mcpwm0_evt_op2_teb_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents MCPWM0_evt_op2_teb trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op2_teb_st:1;
        /** mcpwm0_evt_f0_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents MCPWM0_evt_f0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_f0_st:1;
        /** mcpwm0_evt_f1_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents MCPWM0_evt_f1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_f1_st:1;
        /** mcpwm0_evt_f2_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents MCPWM0_evt_f2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_f2_st:1;
        /** mcpwm0_evt_f0_clr_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents MCPWM0_evt_f0_clr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_f0_clr_st:1;
        /** mcpwm0_evt_f1_clr_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents MCPWM0_evt_f1_clr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_f1_clr_st:1;
        /** mcpwm0_evt_f2_clr_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents MCPWM0_evt_f2_clr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_f2_clr_st:1;
        /** mcpwm0_evt_tz0_cbc_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents MCPWM0_evt_tz0_cbc trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_tz0_cbc_st:1;
        /** mcpwm0_evt_tz1_cbc_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents MCPWM0_evt_tz1_cbc trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_tz1_cbc_st:1;
        /** mcpwm0_evt_tz2_cbc_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents MCPWM0_evt_tz2_cbc trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_tz2_cbc_st:1;
        /** mcpwm0_evt_tz0_ost_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents MCPWM0_evt_tz0_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_tz0_ost_st:1;
        /** mcpwm0_evt_tz1_ost_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents MCPWM0_evt_tz1_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_tz1_ost_st:1;
        /** mcpwm0_evt_tz2_ost_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents MCPWM0_evt_tz2_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_tz2_ost_st:1;
        /** mcpwm0_evt_cap0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents MCPWM0_evt_cap0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_cap0_st:1;
        /** mcpwm0_evt_cap1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents MCPWM0_evt_cap1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_cap1_st:1;
        /** mcpwm0_evt_cap2_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents MCPWM0_evt_cap2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_cap2_st:1;
        /** mcpwm0_evt_op0_tee1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents MCPWM0_evt_op0_tee1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op0_tee1_st:1;
        /** mcpwm0_evt_op1_tee1_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MCPWM0_evt_op1_tee1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op1_tee1_st:1;
        /** mcpwm0_evt_op2_tee1_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM0_evt_op2_tee1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op2_tee1_st:1;
        /** mcpwm0_evt_op0_tee2_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM0_evt_op0_tee2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op0_tee2_st:1;
        /** mcpwm0_evt_op1_tee2_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM0_evt_op1_tee2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op1_tee2_st:1;
        /** mcpwm0_evt_op2_tee2_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM0_evt_op2_tee2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_evt_op2_tee2_st:1;
        /** mcpwm1_evt_timer0_stop_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents MCPWM1_evt_timer0_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm1_evt_timer0_stop_st:1;
        /** mcpwm1_evt_timer1_stop_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents MCPWM1_evt_timer1_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm1_evt_timer1_stop_st:1;
        /** mcpwm1_evt_timer2_stop_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents MCPWM1_evt_timer2_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm1_evt_timer2_stop_st:1;
        /** mcpwm1_evt_timer0_tez_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents MCPWM1_evt_timer0_tez trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm1_evt_timer0_tez_st:1;
        /** mcpwm1_evt_timer1_tez_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents MCPWM1_evt_timer1_tez trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm1_evt_timer1_tez_st:1;
        /** mcpwm1_evt_timer2_tez_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents MCPWM1_evt_timer2_tez trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm1_evt_timer2_tez_st:1;
        /** mcpwm1_evt_timer0_tep_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents MCPWM1_evt_timer0_tep trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm1_evt_timer0_tep_st:1;
    };
    uint32_t val;
} soc_etm_evt_st3_reg_t;

