espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of evt_st7 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** mcpwm3_evt_op1_teb_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MCPWM3_evt_op1_teb trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op1_teb_st:1;
        /** mcpwm3_evt_op2_teb_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents MCPWM3_evt_op2_teb trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op2_teb_st:1;
        /** mcpwm3_evt_f0_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents MCPWM3_evt_f0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_f0_st:1;
        /** mcpwm3_evt_f1_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents MCPWM3_evt_f1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_f1_st:1;
        /** mcpwm3_evt_f2_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents MCPWM3_evt_f2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_f2_st:1;
        /** mcpwm3_evt_f0_clr_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents MCPWM3_evt_f0_clr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_f0_clr_st:1;
        /** mcpwm3_evt_f1_clr_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents MCPWM3_evt_f1_clr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_f1_clr_st:1;
        /** mcpwm3_evt_f2_clr_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents MCPWM3_evt_f2_clr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_f2_clr_st:1;
        /** mcpwm3_evt_tz0_cbc_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents MCPWM3_evt_tz0_cbc trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_tz0_cbc_st:1;
        /** mcpwm3_evt_tz1_cbc_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents MCPWM3_evt_tz1_cbc trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_tz1_cbc_st:1;
        /** mcpwm3_evt_tz2_cbc_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents MCPWM3_evt_tz2_cbc trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_tz2_cbc_st:1;
        /** mcpwm3_evt_tz0_ost_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents MCPWM3_evt_tz0_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_tz0_ost_st:1;
        /** mcpwm3_evt_tz1_ost_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents MCPWM3_evt_tz1_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_tz1_ost_st:1;
        /** mcpwm3_evt_tz2_ost_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents MCPWM3_evt_tz2_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_tz2_ost_st:1;
        /** mcpwm3_evt_cap0_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents MCPWM3_evt_cap0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_cap0_st:1;
        /** mcpwm3_evt_cap1_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents MCPWM3_evt_cap1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_cap1_st:1;
        /** mcpwm3_evt_cap2_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents MCPWM3_evt_cap2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_cap2_st:1;
        /** mcpwm3_evt_op0_tee1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents MCPWM3_evt_op0_tee1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op0_tee1_st:1;
        /** mcpwm3_evt_op1_tee1_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents MCPWM3_evt_op1_tee1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op1_tee1_st:1;
        /** mcpwm3_evt_op2_tee1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents MCPWM3_evt_op2_tee1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op2_tee1_st:1;
        /** mcpwm3_evt_op0_tee2_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MCPWM3_evt_op0_tee2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op0_tee2_st:1;
        /** mcpwm3_evt_op1_tee2_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM3_evt_op1_tee2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op1_tee2_st:1;
        /** mcpwm3_evt_op2_tee2_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM3_evt_op2_tee2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_evt_op2_tee2_st:1;
        /** adc_evt_eq_above_thresh0_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents ADC_evt_eq_above_thresh0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_above_thresh0_st:1;
        /** adc_evt_eq_above_thresh1_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents ADC_evt_eq_above_thresh1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_above_thresh1_st:1;
        /** adc_evt_eq_below_thresh0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents ADC_evt_eq_below_thresh0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_below_thresh0_st:1;
        /** adc_evt_eq_below_thresh1_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents ADC_evt_eq_below_thresh1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_below_thresh1_st:1;
        /** adc_evt_adc1_start_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents ADC_evt_adc1_start trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_adc1_start_st:1;
        /** adc_evt_adc2_start_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents ADC_evt_adc2_start trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_adc2_start_st:1;
        /** adc_evt_adc1_done_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents ADC_evt_adc1_done trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_adc1_done_st:1;
        /** adc_evt_adc2_done_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents ADC_evt_adc2_done trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_adc2_done_st:1;
        /** regdma_evt_done0_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents REGDMA_evt_done0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_done0_st:1;
    };
    uint32_t val;
} soc_etm_evt_st7_reg_t;

/** Type of evt_st8 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** regdma_evt_done1_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents REGDMA_evt_done1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_done1_st:1;
        /** regdma_evt_done2_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents REGDMA_evt_done2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_done2_st:1;
        /** regdma_evt_done3_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents REGDMA_evt_done3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_done3_st:1;
        /** regdma_evt_fail0_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents REGDMA_evt_fail0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_fail0_st:1;
        /** regdma_evt_fail1_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents REGDMA_evt_fail1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_fail1_st:1;
        /** regdma_evt_fail2_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents REGDMA_evt_fail2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_fail2_st:1;
        /** regdma_evt_fail3_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents REGDMA_evt_fail3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_evt_fail3_st:1;
        /** tmpsnsr_evt_over_limit_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents TMPSNSR_evt_over_limit trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tmpsnsr_evt_over_limit_st:1;
        /** i2s0_evt_rx_done_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents I2S0_evt_rx_done trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_rx_done_st:1;
        /** i2s0_evt_tx_done_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents I2S0_evt_tx_done trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_tx_done_st:1;
        /** i2s0_evt_x_words_received_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents I2S0_evt_x_words_received trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_x_words_received_st:1;
        /** i2s0_evt_x_words_sent_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents I2S0_evt_x_words_sent trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_x_words_sent_st:1;
        /** i2s1_evt_rx_done_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents I2S1_evt_rx_done trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_evt_rx_done_st:1;
        /** i2s1_evt_tx_done_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents I2S1_evt_tx_done trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_evt_tx_done_st:1;
        /** i2s1_evt_x_words_received_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents I2S1_evt_x_words_received trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_evt_x_words_received_st:1;
        /** i2s1_evt_x_words_sent_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents I2S1_evt_x_words_sent trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_evt_x_words_sent_st:1;
        /** ulp_evt_err_intr_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents ULP_evt_err_intr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ulp_evt_err_intr_st:1;
        /** ulp_evt_halt_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents ULP_evt_halt trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ulp_evt_halt_st:1;
        /** ulp_evt_start_intr_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents ULP_evt_start_intr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ulp_evt_start_intr_st:1;
        /** rtc_evt_tick_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents RTC_evt_tick trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t rtc_evt_tick_st:1;
        /** rtc_evt_ovf_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents RTC_evt_ovf trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t rtc_evt_ovf_st:1;
        /** rtc_evt_cmp_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents RTC_evt_cmp trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t rtc_evt_cmp_st:1;
        /** pmu_evt_sleep_weekup_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents PMU_evt_sleep_weekup trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pmu_evt_sleep_weekup_st:1;
        /** pdma_ahb_evt_in_done_ch0_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents PDMA_AHB_evt_in_done_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_done_ch0_st:1;
        /** pdma_ahb_evt_in_done_ch1_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents PDMA_AHB_evt_in_done_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_done_ch1_st:1;
        /** pdma_ahb_evt_in_done_ch2_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents PDMA_AHB_evt_in_done_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_done_ch2_st:1;
        /** pdma_ahb_evt_in_done_ch3_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents PDMA_AHB_evt_in_done_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_done_ch3_st:1;
        /** pdma_ahb_evt_in_done_ch4_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents PDMA_AHB_evt_in_done_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_done_ch4_st:1;
        /** pdma_ahb_evt_in_suc_eof_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents PDMA_AHB_evt_in_suc_eof_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_suc_eof_ch0_st:1;
        /** pdma_ahb_evt_in_suc_eof_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents PDMA_AHB_evt_in_suc_eof_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_suc_eof_ch1_st:1;
        /** pdma_ahb_evt_in_suc_eof_ch2_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents PDMA_AHB_evt_in_suc_eof_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_suc_eof_ch2_st:1;
        /** pdma_ahb_evt_in_suc_eof_ch3_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents PDMA_AHB_evt_in_suc_eof_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_suc_eof_ch3_st:1;
    };
    uint32_t val;
} soc_etm_evt_st8_reg_t;

