espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of evt_st9 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** pdma_ahb_evt_in_suc_eof_ch4_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents PDMA_AHB_evt_in_suc_eof_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_suc_eof_ch4_st:1;
        /** pdma_ahb_evt_in_fifo_empty_ch0_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_empty_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_empty_ch0_st:1;
        /** pdma_ahb_evt_in_fifo_empty_ch1_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_empty_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_empty_ch1_st:1;
        /** pdma_ahb_evt_in_fifo_empty_ch2_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_empty_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_empty_ch2_st:1;
        /** pdma_ahb_evt_in_fifo_empty_ch3_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_empty_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_empty_ch3_st:1;
        /** pdma_ahb_evt_in_fifo_empty_ch4_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_empty_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_empty_ch4_st:1;
        /** pdma_ahb_evt_in_fifo_full_ch0_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_full_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_full_ch0_st:1;
        /** pdma_ahb_evt_in_fifo_full_ch1_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_full_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_full_ch1_st:1;
        /** pdma_ahb_evt_in_fifo_full_ch2_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_full_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_full_ch2_st:1;
        /** pdma_ahb_evt_in_fifo_full_ch3_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_full_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_full_ch3_st:1;
        /** pdma_ahb_evt_in_fifo_full_ch4_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents PDMA_AHB_evt_in_fifo_full_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_in_fifo_full_ch4_st:1;
        /** pdma_ahb_evt_out_done_ch0_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents PDMA_AHB_evt_out_done_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_done_ch0_st:1;
        /** pdma_ahb_evt_out_done_ch1_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents PDMA_AHB_evt_out_done_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_done_ch1_st:1;
        /** pdma_ahb_evt_out_done_ch2_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents PDMA_AHB_evt_out_done_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_done_ch2_st:1;
        /** pdma_ahb_evt_out_done_ch3_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents PDMA_AHB_evt_out_done_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_done_ch3_st:1;
        /** pdma_ahb_evt_out_done_ch4_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents PDMA_AHB_evt_out_done_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_done_ch4_st:1;
        /** pdma_ahb_evt_out_eof_ch0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents PDMA_AHB_evt_out_eof_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_eof_ch0_st:1;
        /** pdma_ahb_evt_out_eof_ch1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents PDMA_AHB_evt_out_eof_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_eof_ch1_st:1;
        /** pdma_ahb_evt_out_eof_ch2_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents PDMA_AHB_evt_out_eof_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_eof_ch2_st:1;
        /** pdma_ahb_evt_out_eof_ch3_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents PDMA_AHB_evt_out_eof_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_eof_ch3_st:1;
        /** pdma_ahb_evt_out_eof_ch4_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents PDMA_AHB_evt_out_eof_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_eof_ch4_st:1;
        /** pdma_ahb_evt_out_total_eof_ch0_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents PDMA_AHB_evt_out_total_eof_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_total_eof_ch0_st:1;
        /** pdma_ahb_evt_out_total_eof_ch1_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents PDMA_AHB_evt_out_total_eof_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_total_eof_ch1_st:1;
        /** pdma_ahb_evt_out_total_eof_ch2_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents PDMA_AHB_evt_out_total_eof_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_total_eof_ch2_st:1;
        /** pdma_ahb_evt_out_total_eof_ch3_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents PDMA_AHB_evt_out_total_eof_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_total_eof_ch3_st:1;
        /** pdma_ahb_evt_out_total_eof_ch4_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents PDMA_AHB_evt_out_total_eof_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_total_eof_ch4_st:1;
        /** pdma_ahb_evt_out_fifo_empty_ch0_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_empty_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_empty_ch0_st:1;
        /** pdma_ahb_evt_out_fifo_empty_ch1_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_empty_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_empty_ch1_st:1;
        /** pdma_ahb_evt_out_fifo_empty_ch2_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_empty_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_empty_ch2_st:1;
        /** pdma_ahb_evt_out_fifo_empty_ch3_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_empty_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_empty_ch3_st:1;
        /** pdma_ahb_evt_out_fifo_empty_ch4_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_empty_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_empty_ch4_st:1;
        /** pdma_ahb_evt_out_fifo_full_ch0_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_full_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_full_ch0_st:1;
    };
    uint32_t val;
} soc_etm_evt_st9_reg_t;

/** Type of evt_st10 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** pdma_ahb_evt_out_fifo_full_ch1_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_full_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_full_ch1_st:1;
        /** pdma_ahb_evt_out_fifo_full_ch2_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_full_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_full_ch2_st:1;
        /** pdma_ahb_evt_out_fifo_full_ch3_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_full_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_full_ch3_st:1;
        /** pdma_ahb_evt_out_fifo_full_ch4_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents PDMA_AHB_evt_out_fifo_full_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_evt_out_fifo_full_ch4_st:1;
        /** lp_pdma_ahb_evt_in_done_ch0_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_done_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_done_ch0_st:1;
        /** lp_pdma_ahb_evt_in_done_ch1_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_done_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_done_ch1_st:1;
        /** lp_pdma_ahb_evt_in_suc_eof_ch0_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_suc_eof_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_suc_eof_ch0_st:1;
        /** lp_pdma_ahb_evt_in_suc_eof_ch1_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_suc_eof_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_suc_eof_ch1_st:1;
        /** lp_pdma_ahb_evt_in_fifo_empty_ch0_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_fifo_empty_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_fifo_empty_ch0_st:1;
        /** lp_pdma_ahb_evt_in_fifo_empty_ch1_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_fifo_empty_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_fifo_empty_ch1_st:1;
        /** lp_pdma_ahb_evt_in_fifo_full_ch0_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_fifo_full_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_fifo_full_ch0_st:1;
        /** lp_pdma_ahb_evt_in_fifo_full_ch1_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LP_PDMA_AHB_evt_in_fifo_full_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_in_fifo_full_ch1_st:1;
        /** lp_pdma_ahb_evt_out_done_ch0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_done_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_done_ch0_st:1;
        /** lp_pdma_ahb_evt_out_done_ch1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_done_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_done_ch1_st:1;
        /** lp_pdma_ahb_evt_out_eof_ch0_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_eof_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_eof_ch0_st:1;
        /** lp_pdma_ahb_evt_out_eof_ch1_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_eof_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_eof_ch1_st:1;
        /** lp_pdma_ahb_evt_out_total_eof_ch0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_total_eof_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_total_eof_ch0_st:1;
        /** lp_pdma_ahb_evt_out_total_eof_ch1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_total_eof_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_total_eof_ch1_st:1;
        /** lp_pdma_ahb_evt_out_fifo_empty_ch0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_fifo_empty_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_fifo_empty_ch0_st:1;
        /** lp_pdma_ahb_evt_out_fifo_empty_ch1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_fifo_empty_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_fifo_empty_ch1_st:1;
        /** lp_pdma_ahb_evt_out_fifo_full_ch0_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_fifo_full_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_fifo_full_ch0_st:1;
        /** lp_pdma_ahb_evt_out_fifo_full_ch1_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents LP_PDMA_AHB_evt_out_fifo_full_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t lp_pdma_ahb_evt_out_fifo_full_ch1_st:1;
        /** pdma_axi_evt_in_done_ch0_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents PDMA_AXI_evt_in_done_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_done_ch0_st:1;
        /** pdma_axi_evt_in_done_ch1_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents PDMA_AXI_evt_in_done_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_done_ch1_st:1;
        /** pdma_axi_evt_in_done_ch2_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents PDMA_AXI_evt_in_done_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_done_ch2_st:1;
        /** pdma_axi_evt_in_suc_eof_ch0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents PDMA_AXI_evt_in_suc_eof_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_suc_eof_ch0_st:1;
        /** pdma_axi_evt_in_suc_eof_ch1_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents PDMA_AXI_evt_in_suc_eof_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_suc_eof_ch1_st:1;
        /** pdma_axi_evt_in_suc_eof_ch2_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents PDMA_AXI_evt_in_suc_eof_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_suc_eof_ch2_st:1;
        /** pdma_axi_evt_in_fifo_empty_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents PDMA_AXI_evt_in_fifo_empty_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_fifo_empty_ch0_st:1;
        /** pdma_axi_evt_in_fifo_empty_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents PDMA_AXI_evt_in_fifo_empty_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_fifo_empty_ch1_st:1;
        /** pdma_axi_evt_in_fifo_empty_ch2_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents PDMA_AXI_evt_in_fifo_empty_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_fifo_empty_ch2_st:1;
        /** pdma_axi_evt_in_fifo_full_ch0_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents PDMA_AXI_evt_in_fifo_full_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_axi_evt_in_fifo_full_ch0_st:1;
    };
    uint32_t val;
} soc_etm_evt_st10_reg_t;

