espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of task_st5 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** tg0_task_cnt_start_timer0_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents TG0_task_cnt_start_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_start_timer0_st:1;
        /** tg0_task_alarm_start_timer0_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents TG0_task_alarm_start_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_alarm_start_timer0_st:1;
        /** tg0_task_cnt_stop_timer0_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents TG0_task_cnt_stop_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_stop_timer0_st:1;
        /** tg0_task_cnt_reload_timer0_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents TG0_task_cnt_reload_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_reload_timer0_st:1;
        /** tg0_task_cnt_cap_timer0_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents TG0_task_cnt_cap_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_cap_timer0_st:1;
        /** tg0_task_cnt_start_timer1_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents TG0_task_cnt_start_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_start_timer1_st:1;
        /** tg0_task_alarm_start_timer1_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents TG0_task_alarm_start_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_alarm_start_timer1_st:1;
        /** tg0_task_cnt_stop_timer1_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents TG0_task_cnt_stop_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_stop_timer1_st:1;
        /** tg0_task_cnt_reload_timer1_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents TG0_task_cnt_reload_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_reload_timer1_st:1;
        /** tg0_task_cnt_cap_timer1_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents TG0_task_cnt_cap_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_cap_timer1_st:1;
        /** tg1_task_cnt_start_timer0_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents TG1_task_cnt_start_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_start_timer0_st:1;
        /** tg1_task_alarm_start_timer0_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents TG1_task_alarm_start_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_alarm_start_timer0_st:1;
        /** tg1_task_cnt_stop_timer0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents TG1_task_cnt_stop_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_stop_timer0_st:1;
        /** tg1_task_cnt_reload_timer0_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents TG1_task_cnt_reload_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_reload_timer0_st:1;
        /** tg1_task_cnt_cap_timer0_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents TG1_task_cnt_cap_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_cap_timer0_st:1;
        /** tg1_task_cnt_start_timer1_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents TG1_task_cnt_start_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_start_timer1_st:1;
        /** tg1_task_alarm_start_timer1_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents TG1_task_alarm_start_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_alarm_start_timer1_st:1;
        /** tg1_task_cnt_stop_timer1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents TG1_task_cnt_stop_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_stop_timer1_st:1;
        /** tg1_task_cnt_reload_timer1_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents TG1_task_cnt_reload_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_reload_timer1_st:1;
        /** tg1_task_cnt_cap_timer1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents TG1_task_cnt_cap_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_cap_timer1_st:1;
        /** mcpwm0_task_cmpr0_a_up_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MCPWM0_task_cmpr0_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_cmpr0_a_up_st:1;
        /** mcpwm0_task_cmpr1_a_up_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM0_task_cmpr1_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_cmpr1_a_up_st:1;
        /** mcpwm0_task_cmpr2_a_up_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM0_task_cmpr2_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_cmpr2_a_up_st:1;
        /** mcpwm0_task_cmpr0_b_up_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM0_task_cmpr0_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_cmpr0_b_up_st:1;
        /** mcpwm0_task_cmpr1_b_up_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM0_task_cmpr1_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_cmpr1_b_up_st:1;
        /** mcpwm0_task_cmpr2_b_up_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents MCPWM0_task_cmpr2_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_cmpr2_b_up_st:1;
        /** mcpwm0_task_gen_stop_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents MCPWM0_task_gen_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_gen_stop_st:1;
        /** mcpwm0_task_timer0_syn_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents MCPWM0_task_timer0_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_timer0_syn_st:1;
        /** mcpwm0_task_timer1_syn_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents MCPWM0_task_timer1_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_timer1_syn_st:1;
        /** mcpwm0_task_timer2_syn_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents MCPWM0_task_timer2_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_timer2_syn_st:1;
        /** mcpwm0_task_timer0_period_up_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents MCPWM0_task_timer0_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_timer0_period_up_st:1;
        /** mcpwm0_task_timer1_period_up_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents MCPWM0_task_timer1_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm0_task_timer1_period_up_st:1;
    };
    uint32_t val;
} soc_etm_task_st5_reg_t;

