espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of task_st8 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** mcpwm2_task_cap1_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MCPWM2_task_cap1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_cap1_st:1;
        /** mcpwm2_task_cap2_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents MCPWM2_task_cap2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_cap2_st:1;
        /** mcpwm2_task_timer0_a_up_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents MCPWM2_task_timer0_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_timer0_a_up_st:1;
        /** mcpwm2_task_timer1_a_up_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents MCPWM2_task_timer1_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_timer1_a_up_st:1;
        /** mcpwm2_task_timer2_a_up_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents MCPWM2_task_timer2_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_timer2_a_up_st:1;
        /** mcpwm2_task_timer0_b_up_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents MCPWM2_task_timer0_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_timer0_b_up_st:1;
        /** mcpwm2_task_timer1_b_up_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents MCPWM2_task_timer1_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_timer1_b_up_st:1;
        /** mcpwm2_task_timer2_b_up_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents MCPWM2_task_timer2_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm2_task_timer2_b_up_st:1;
        /** mcpwm3_task_cmpr0_a_up_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents MCPWM3_task_cmpr0_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cmpr0_a_up_st:1;
        /** mcpwm3_task_cmpr1_a_up_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents MCPWM3_task_cmpr1_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cmpr1_a_up_st:1;
        /** mcpwm3_task_cmpr2_a_up_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents MCPWM3_task_cmpr2_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cmpr2_a_up_st:1;
        /** mcpwm3_task_cmpr0_b_up_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents MCPWM3_task_cmpr0_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cmpr0_b_up_st:1;
        /** mcpwm3_task_cmpr1_b_up_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents MCPWM3_task_cmpr1_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cmpr1_b_up_st:1;
        /** mcpwm3_task_cmpr2_b_up_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents MCPWM3_task_cmpr2_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cmpr2_b_up_st:1;
        /** mcpwm3_task_gen_stop_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents MCPWM3_task_gen_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_gen_stop_st:1;
        /** mcpwm3_task_timer0_syn_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents MCPWM3_task_timer0_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer0_syn_st:1;
        /** mcpwm3_task_timer1_syn_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents MCPWM3_task_timer1_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer1_syn_st:1;
        /** mcpwm3_task_timer2_syn_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents MCPWM3_task_timer2_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer2_syn_st:1;
        /** mcpwm3_task_timer0_period_up_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents MCPWM3_task_timer0_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer0_period_up_st:1;
        /** mcpwm3_task_timer1_period_up_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents MCPWM3_task_timer1_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer1_period_up_st:1;
        /** mcpwm3_task_timer2_period_up_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MCPWM3_task_timer2_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer2_period_up_st:1;
        /** mcpwm3_task_tz0_ost_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM3_task_tz0_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_tz0_ost_st:1;
        /** mcpwm3_task_tz1_ost_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM3_task_tz1_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_tz1_ost_st:1;
        /** mcpwm3_task_tz2_ost_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM3_task_tz2_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_tz2_ost_st:1;
        /** mcpwm3_task_clr0_ost_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM3_task_clr0_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_clr0_ost_st:1;
        /** mcpwm3_task_clr1_ost_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents MCPWM3_task_clr1_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_clr1_ost_st:1;
        /** mcpwm3_task_clr2_ost_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents MCPWM3_task_clr2_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_clr2_ost_st:1;
        /** mcpwm3_task_cap0_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents MCPWM3_task_cap0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cap0_st:1;
        /** mcpwm3_task_cap1_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents MCPWM3_task_cap1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cap1_st:1;
        /** mcpwm3_task_cap2_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents MCPWM3_task_cap2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_cap2_st:1;
        /** mcpwm3_task_timer0_a_up_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents MCPWM3_task_timer0_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer0_a_up_st:1;
        /** mcpwm3_task_timer1_a_up_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents MCPWM3_task_timer1_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer1_a_up_st:1;
    };
    uint32_t val;
} soc_etm_task_st8_reg_t;

/** Type of task_st9 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** mcpwm3_task_timer2_a_up_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MCPWM3_task_timer2_a_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer2_a_up_st:1;
        /** mcpwm3_task_timer0_b_up_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents MCPWM3_task_timer0_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer0_b_up_st:1;
        /** mcpwm3_task_timer1_b_up_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents MCPWM3_task_timer1_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer1_b_up_st:1;
        /** mcpwm3_task_timer2_b_up_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents MCPWM3_task_timer2_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t mcpwm3_task_timer2_b_up_st:1;
        /** adc_task_sample1_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents ADC_task_sample1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_task_sample1_st:1;
        /** adc_task_sample2_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents ADC_task_sample2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_task_sample2_st:1;
        /** adc_task_stop1_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents ADC_task_stop1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_task_stop1_st:1;
        /** adc_task_stop2_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents ADC_task_stop2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_task_stop2_st:1;
        /** regdma_task_start0_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents REGDMA_task_start0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_task_start0_st:1;
        /** regdma_task_start1_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents REGDMA_task_start1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_task_start1_st:1;
        /** regdma_task_start2_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents REGDMA_task_start2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_task_start2_st:1;
        /** regdma_task_start3_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents REGDMA_task_start3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t regdma_task_start3_st:1;
        /** tmpsnsr_task_start_sample_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents TMPSNSR_task_start_sample trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tmpsnsr_task_start_sample_st:1;
        /** tmpsnsr_task_stop_sample_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents TMPSNSR_task_stop_sample trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tmpsnsr_task_stop_sample_st:1;
        /** i2s0_task_start_rx_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents I2S0_task_start_rx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_task_start_rx_st:1;
        /** i2s0_task_start_tx_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents I2S0_task_start_tx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_task_start_tx_st:1;
        /** i2s0_task_stop_rx_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents I2S0_task_stop_rx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_task_stop_rx_st:1;
        /** i2s0_task_stop_tx_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents I2S0_task_stop_tx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_task_stop_tx_st:1;
        /** i2s0_task_sync_check_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents I2S0_task_sync_check trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_task_sync_check_st:1;
        /** i2s1_task_start_rx_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents I2S1_task_start_rx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_task_start_rx_st:1;
        /** i2s1_task_start_tx_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents I2S1_task_start_tx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_task_start_tx_st:1;
        /** i2s1_task_stop_rx_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents I2S1_task_stop_rx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_task_stop_rx_st:1;
        /** i2s1_task_stop_tx_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents I2S1_task_stop_tx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_task_stop_tx_st:1;
        /** i2s1_task_sync_check_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents I2S1_task_sync_check trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s1_task_sync_check_st:1;
        /** ulp_task_wakeup_cpu_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents ULP_task_wakeup_cpu trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ulp_task_wakeup_cpu_st:1;
        /** ulp_task_int_cpu_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents ULP_task_int_cpu trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ulp_task_int_cpu_st:1;
        /** pmu_task_sleep_req_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents PMU_task_sleep_req trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pmu_task_sleep_req_st:1;
        /** pdma_ahb_task_in_start_ch0_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch0_st:1;
        /** pdma_ahb_task_in_start_ch1_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch1_st:1;
        /** pdma_ahb_task_in_start_ch2_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch2_st:1;
        /** pdma_ahb_task_in_start_ch3_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch3_st:1;
        /** pdma_ahb_task_in_start_ch4_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch4_st:1;
    };
    uint32_t val;
} soc_etm_task_st9_reg_t;

