espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of task_st11 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** modem_task_g3_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MODEM_task_g3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t modem_task_g3_st:1;
        /** cordic_task_cal_start_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents CORDIC_task_cal_start trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t cordic_task_cal_start_st:1;
        /** zero_det_task_start_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents ZERO_DET_task_start trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t zero_det_task_start_st:1;
        /** systimer_task_cnt_upd0_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents SYSTIMER_task_cnt_upd0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t systimer_task_cnt_upd0_st:1;
        /** systimer_task_cnt_upd1_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents SYSTIMER_task_cnt_upd1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t systimer_task_cnt_upd1_st:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} soc_etm_task_st11_reg_t;


/** Group: Configuration Register */
/** Type of ch_ena_ad0_set register
 *  Channel enable set register
 */
typedef union {
    struct {
        /** ch_enable0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable ch0.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable0:1;
        /** ch_enable1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable ch1.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable1:1;
        /** ch_enable2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable ch2.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable2:1;
        /** ch_enable3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable ch3.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable3:1;
        /** ch_enable4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable ch4.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable4:1;
        /** ch_enable5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable ch5.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable5:1;
        /** ch_enable6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable ch6.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable6:1;
        /** ch_enable7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable ch7.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable7:1;
        /** ch_enable8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable ch8.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable8:1;
        /** ch_enable9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable ch9.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable9:1;
        /** ch_enable10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable ch10.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable10:1;
        /** ch_enable11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable ch11.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable11:1;
        /** ch_enable12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable ch12.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable12:1;
        /** ch_enable13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable ch13.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable13:1;
        /** ch_enable14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable ch14.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable14:1;
        /** ch_enable15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable ch15.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable15:1;
        /** ch_enable16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable ch16.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable16:1;
        /** ch_enable17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable ch17.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable17:1;
        /** ch_enable18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to enable ch18.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable18:1;
        /** ch_enable19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to enable ch19.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable19:1;
        /** ch_enable20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to enable ch20.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable20:1;
        /** ch_enable21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to enable ch21.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable21:1;
        /** ch_enable22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to enable ch22.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable22:1;
        /** ch_enable23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to enable ch23.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable23:1;
        /** ch_enable24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to enable ch24.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable24:1;
        /** ch_enable25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to enable ch25.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable25:1;
        /** ch_enable26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to enable ch26.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable26:1;
        /** ch_enable27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to enable ch27.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable27:1;
        /** ch_enable28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to enable ch28.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable28:1;
        /** ch_enable29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to enable ch29.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable29:1;
        /** ch_enable30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to enable ch30.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable30:1;
        /** ch_enable31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to enable ch31.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_set_reg_t;

/** Type of ch_ena_ad0_clr register
 *  Channel enable clear register
 */
typedef union {
    struct {
        /** ch_disable0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear ch0 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable0:1;
        /** ch_disable1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear ch1 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable1:1;
        /** ch_disable2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear ch2 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable2:1;
        /** ch_disable3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear ch3 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable3:1;
        /** ch_disable4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear ch4 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable4:1;
        /** ch_disable5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear ch5 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable5:1;
        /** ch_disable6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear ch6 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable6:1;
        /** ch_disable7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ch7 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable7:1;
        /** ch_disable8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear ch8 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable8:1;
        /** ch_disable9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear ch9 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable9:1;
        /** ch_disable10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear ch10 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable10:1;
        /** ch_disable11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear ch11 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable11:1;
        /** ch_disable12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear ch12 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable12:1;
        /** ch_disable13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear ch13 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable13:1;
        /** ch_disable14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear ch14 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable14:1;
        /** ch_disable15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear ch15 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable15:1;
        /** ch_disable16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear ch16 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable16:1;
        /** ch_disable17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear ch17 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable17:1;
        /** ch_disable18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear ch18 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable18:1;
        /** ch_disable19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear ch19 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable19:1;
        /** ch_disable20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear ch20 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable20:1;
        /** ch_disable21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear ch21 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable21:1;
        /** ch_disable22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear ch22 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable22:1;
        /** ch_disable23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear ch23 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable23:1;
        /** ch_disable24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear ch24 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable24:1;
        /** ch_disable25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear ch25 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable25:1;
        /** ch_disable26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear ch26 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable26:1;
        /** ch_disable27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear ch27 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable27:1;
        /** ch_disable28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear ch28 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable28:1;
        /** ch_disable29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear ch29 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable29:1;
        /** ch_disable30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear ch30 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable30:1;
        /** ch_disable31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear ch31 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_clr_reg_t;

/** Type of ch_ena_ad1_set register
 *  Channel enable set register
 */
typedef union {
    struct {
        /** ch_enable32 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable ch32.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable32:1;
        /** ch_enable33 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable ch33.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable33:1;
        /** ch_enable34 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable ch34.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable34:1;
        /** ch_enable35 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable ch35.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable35:1;
        /** ch_enable36 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable ch36.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable36:1;
        /** ch_enable37 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable ch37.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable37:1;
        /** ch_enable38 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable ch38.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable38:1;
        /** ch_enable39 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable ch39.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable39:1;
        /** ch_enable40 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable ch40.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable40:1;
        /** ch_enable41 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable ch41.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable41:1;
        /** ch_enable42 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable ch42.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable42:1;
        /** ch_enable43 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable ch43.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable43:1;
        /** ch_enable44 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable ch44.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable44:1;
        /** ch_enable45 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable ch45.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable45:1;
        /** ch_enable46 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable ch46.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable46:1;
        /** ch_enable47 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable ch47.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable47:1;
        /** ch_enable48 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable ch48.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable48:1;
        /** ch_enable49 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable ch49.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t ch_enable49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_set_reg_t;

