espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of ch_ena_ad1_clr register
 *  Channel enable clear register
 */
typedef union {
    struct {
        /** ch_disable32 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear ch32 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable32:1;
        /** ch_disable33 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear ch33 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable33:1;
        /** ch_disable34 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear ch34 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable34:1;
        /** ch_disable35 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear ch35 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable35:1;
        /** ch_disable36 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear ch36 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable36:1;
        /** ch_disable37 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear ch37 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable37:1;
        /** ch_disable38 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear ch38 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable38:1;
        /** ch_disable39 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ch39 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable39:1;
        /** ch_disable40 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear ch40 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable40:1;
        /** ch_disable41 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear ch41 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable41:1;
        /** ch_disable42 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear ch42 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable42:1;
        /** ch_disable43 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear ch43 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable43:1;
        /** ch_disable44 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear ch44 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable44:1;
        /** ch_disable45 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear ch45 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable45:1;
        /** ch_disable46 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear ch46 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable46:1;
        /** ch_disable47 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear ch47 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable47:1;
        /** ch_disable48 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear ch48 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable48:1;
        /** ch_disable49 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear ch49 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ch_disable49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_clr_reg_t;

/** Type of chn_evt_id register
 *  Channeln event id register
 */
typedef union {
    struct {
        /** chn_evt_id : R/W; bitpos: [8:0]; default: 0;
         *  Configures chn_evt_id
         */
        uint32_t chn_evt_id:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} soc_etm_chn_evt_id_reg_t;

/** Type of chn_task_id register
 *  Channeln task id register
 */
typedef union {
    struct {
        /** chn_task_id : R/W; bitpos: [8:0]; default: 0;
         *  Configures chn_task_id
         */
        uint32_t chn_task_id:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} soc_etm_chn_task_id_reg_t;

/** Type of evt_st0_clr register
 *  Events trigger status clear register
 */
typedef union {
    struct {
        /** gpio_evt_ch0_rise_edge_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch0_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch0_rise_edge_st_clr:1;
        /** gpio_evt_ch1_rise_edge_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch1_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch1_rise_edge_st_clr:1;
        /** gpio_evt_ch2_rise_edge_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch2_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch2_rise_edge_st_clr:1;
        /** gpio_evt_ch3_rise_edge_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch3_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch3_rise_edge_st_clr:1;
        /** gpio_evt_ch4_rise_edge_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch4_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch4_rise_edge_st_clr:1;
        /** gpio_evt_ch5_rise_edge_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch5_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch5_rise_edge_st_clr:1;
        /** gpio_evt_ch6_rise_edge_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch6_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch6_rise_edge_st_clr:1;
        /** gpio_evt_ch7_rise_edge_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch7_rise_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch7_rise_edge_st_clr:1;
        /** gpio_evt_ch0_fall_edge_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch0_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch0_fall_edge_st_clr:1;
        /** gpio_evt_ch1_fall_edge_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch1_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch1_fall_edge_st_clr:1;
        /** gpio_evt_ch2_fall_edge_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch2_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch2_fall_edge_st_clr:1;
        /** gpio_evt_ch3_fall_edge_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch3_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch3_fall_edge_st_clr:1;
        /** gpio_evt_ch4_fall_edge_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch4_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch4_fall_edge_st_clr:1;
        /** gpio_evt_ch5_fall_edge_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch5_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch5_fall_edge_st_clr:1;
        /** gpio_evt_ch6_fall_edge_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch6_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch6_fall_edge_st_clr:1;
        /** gpio_evt_ch7_fall_edge_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch7_fall_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch7_fall_edge_st_clr:1;
        /** gpio_evt_ch0_any_edge_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch0_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch0_any_edge_st_clr:1;
        /** gpio_evt_ch1_any_edge_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch1_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch1_any_edge_st_clr:1;
        /** gpio_evt_ch2_any_edge_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch2_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch2_any_edge_st_clr:1;
        /** gpio_evt_ch3_any_edge_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch3_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch3_any_edge_st_clr:1;
        /** gpio_evt_ch4_any_edge_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch4_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch4_any_edge_st_clr:1;
        /** gpio_evt_ch5_any_edge_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch5_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch5_any_edge_st_clr:1;
        /** gpio_evt_ch6_any_edge_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch6_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch6_any_edge_st_clr:1;
        /** gpio_evt_ch7_any_edge_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear GPIO_evt_ch7_any_edge trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch7_any_edge_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch0_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch0_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch1_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch1_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch2_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch2_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch3_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch3_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch4_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch4_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch5_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch5_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch6_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch6_st_clr:1;
        /** ledc0_evt_duty_chng_end_ch7_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_duty_chng_end_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_duty_chng_end_ch7_st_clr:1;
    };
    uint32_t val;
} soc_etm_evt_st0_clr_reg_t;

/** Type of evt_st1_clr register
 *  Events trigger status clear register
 */
typedef union {
    struct {
        /** ledc0_evt_ovf_cnt_pls_ch0_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch0_st_clr:1;
        /** ledc0_evt_ovf_cnt_pls_ch1_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch1_st_clr:1;
        /** ledc0_evt_ovf_cnt_pls_ch2_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch2_st_clr:1;
        /** ledc0_evt_ovf_cnt_pls_ch3_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch3_st_clr:1;
        /** ledc0_evt_ovf_cnt_pls_ch4_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch4_st_clr:1;
        /** ledc0_evt_ovf_cnt_pls_ch5_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch5_st_clr:1;
        /** ledc0_evt_ovf_cnt_pls_ch6_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch6_st_clr:1;
        /** ledc0_evt_ovf_cnt_pls_ch7_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_ovf_cnt_pls_ch7_st_clr:1;
        /** ledc0_evt_time_ovf_timer0_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_time_ovf_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_time_ovf_timer0_st_clr:1;
        /** ledc0_evt_time_ovf_timer1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_time_ovf_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_time_ovf_timer1_st_clr:1;
        /** ledc0_evt_time_ovf_timer2_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_time_ovf_timer2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_time_ovf_timer2_st_clr:1;
        /** ledc0_evt_time_ovf_timer3_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_time_ovf_timer3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_time_ovf_timer3_st_clr:1;
        /** ledc0_evt_timer0_cmp_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_timer0_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_timer0_cmp_st_clr:1;
        /** ledc0_evt_timer1_cmp_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_timer1_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_timer1_cmp_st_clr:1;
        /** ledc0_evt_timer2_cmp_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_timer2_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_timer2_cmp_st_clr:1;
        /** ledc0_evt_timer3_cmp_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC0_evt_timer3_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_evt_timer3_cmp_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch0_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch0_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch1_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch1_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch2_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch2_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch3_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch3_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch4_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch4_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch5_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch5_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch6_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch6_st_clr:1;
        /** ledc1_evt_duty_chng_end_ch7_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_duty_chng_end_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_duty_chng_end_ch7_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch0_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch0_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch1_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch1_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch2_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch2_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch3_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch3_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch4_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch4_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch5_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch5_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch6_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch6_st_clr:1;
        /** ledc1_evt_ovf_cnt_pls_ch7_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_ovf_cnt_pls_ch7_st_clr:1;
    };
    uint32_t val;
} soc_etm_evt_st1_clr_reg_t;

