espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of evt_st2_clr register
 *  Events trigger status clear register
 */
typedef union {
    struct {
        /** ledc1_evt_time_ovf_timer0_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_time_ovf_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_time_ovf_timer0_st_clr:1;
        /** ledc1_evt_time_ovf_timer1_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_time_ovf_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_time_ovf_timer1_st_clr:1;
        /** ledc1_evt_time_ovf_timer2_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_time_ovf_timer2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_time_ovf_timer2_st_clr:1;
        /** ledc1_evt_time_ovf_timer3_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_time_ovf_timer3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_time_ovf_timer3_st_clr:1;
        /** ledc1_evt_timer0_cmp_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_timer0_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_timer0_cmp_st_clr:1;
        /** ledc1_evt_timer1_cmp_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_timer1_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_timer1_cmp_st_clr:1;
        /** ledc1_evt_timer2_cmp_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_timer2_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_timer2_cmp_st_clr:1;
        /** ledc1_evt_timer3_cmp_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC1_evt_timer3_cmp trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_evt_timer3_cmp_st_clr:1;
        /** tg0_evt_cnt_cmp_timer0_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear TG0_evt_cnt_cmp_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_evt_cnt_cmp_timer0_st_clr:1;
        /** tg0_evt_cnt_cmp_timer1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear TG0_evt_cnt_cmp_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_evt_cnt_cmp_timer1_st_clr:1;
        /** tg1_evt_cnt_cmp_timer0_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear TG1_evt_cnt_cmp_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_evt_cnt_cmp_timer0_st_clr:1;
        /** tg1_evt_cnt_cmp_timer1_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear TG1_evt_cnt_cmp_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_evt_cnt_cmp_timer1_st_clr:1;
        /** systimer_evt_cnt_cmp0_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear SYSTIMER_evt_cnt_cmp0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t systimer_evt_cnt_cmp0_st_clr:1;
        /** systimer_evt_cnt_cmp1_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear SYSTIMER_evt_cnt_cmp1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t systimer_evt_cnt_cmp1_st_clr:1;
        /** systimer_evt_cnt_cmp2_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear SYSTIMER_evt_cnt_cmp2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t systimer_evt_cnt_cmp2_st_clr:1;
        /** mcpwm0_evt_timer0_stop_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer0_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer0_stop_st_clr:1;
        /** mcpwm0_evt_timer1_stop_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer1_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer1_stop_st_clr:1;
        /** mcpwm0_evt_timer2_stop_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer2_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer2_stop_st_clr:1;
        /** mcpwm0_evt_timer0_tez_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer0_tez trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer0_tez_st_clr:1;
        /** mcpwm0_evt_timer1_tez_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer1_tez trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer1_tez_st_clr:1;
        /** mcpwm0_evt_timer2_tez_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer2_tez trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer2_tez_st_clr:1;
        /** mcpwm0_evt_timer0_tep_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer0_tep trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer0_tep_st_clr:1;
        /** mcpwm0_evt_timer1_tep_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer1_tep trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer1_tep_st_clr:1;
        /** mcpwm0_evt_timer2_tep_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer2_tep trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer2_tep_st_clr:1;
        /** mcpwm0_evt_timer0_tea_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer0_tea trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer0_tea_st_clr:1;
        /** mcpwm0_evt_timer1_tea_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer1_tea trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer1_tea_st_clr:1;
        /** mcpwm0_evt_timer2_tea_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer2_tea trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer2_tea_st_clr:1;
        /** mcpwm0_evt_timer0_teb_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer0_teb trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer0_teb_st_clr:1;
        /** mcpwm0_evt_timer1_teb_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer1_teb trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer1_teb_st_clr:1;
        /** mcpwm0_evt_timer2_teb_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_timer2_teb trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_timer2_teb_st_clr:1;
        /** mcpwm0_evt_op0_tea_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op0_tea trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_op0_tea_st_clr:1;
        /** mcpwm0_evt_op1_tea_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op1_tea trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_evt_op1_tea_st_clr:1;
    };
    uint32_t val;
} soc_etm_evt_st2_clr_reg_t;

