espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of evt_st12_clr register
 *  Events trigger status clear register
 */
typedef union {
    struct {
        /** dma2d_evt_out_total_eof_ch1_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear DMA2D_evt_out_total_eof_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_evt_out_total_eof_ch1_st_clr:1;
        /** dma2d_evt_out_total_eof_ch2_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear DMA2D_evt_out_total_eof_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_evt_out_total_eof_ch2_st_clr:1;
        /** dma2d_evt_out_total_eof_ch3_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear DMA2D_evt_out_total_eof_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_evt_out_total_eof_ch3_st_clr:1;
        /** modem_evt_g0_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear MODEM_evt_g0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_evt_g0_st_clr:1;
        /** modem_evt_g1_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear MODEM_evt_g1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_evt_g1_st_clr:1;
        /** modem_evt_g2_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear MODEM_evt_g2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_evt_g2_st_clr:1;
        /** modem_evt_g3_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear MODEM_evt_g3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_evt_g3_st_clr:1;
        /** zero_det_evt_delay_channel_1_pos_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ZERO_DET_evt_delay_channel_1_pos trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t zero_det_evt_delay_channel_1_pos_st_clr:1;
        /** zero_det_evt_delay_channel_2_pos_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear ZERO_DET_evt_delay_channel_2_pos trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t zero_det_evt_delay_channel_2_pos_st_clr:1;
        /** zero_det_evt_delay_channel_3_pos_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear ZERO_DET_evt_delay_channel_3_pos trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t zero_det_evt_delay_channel_3_pos_st_clr:1;
        /** zero_det_evt_delay_channel_1_neg_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear ZERO_DET_evt_delay_channel_1_neg trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t zero_det_evt_delay_channel_1_neg_st_clr:1;
        /** zero_det_evt_delay_channel_2_neg_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear ZERO_DET_evt_delay_channel_2_neg trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t zero_det_evt_delay_channel_2_neg_st_clr:1;
        /** zero_det_evt_delay_channel_3_neg_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear ZERO_DET_evt_delay_channel_3_neg trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t zero_det_evt_delay_channel_3_neg_st_clr:1;
        /** cordic_evt_res_rdy_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear CORDIC_evt_res_rdy trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t cordic_evt_res_rdy_st_clr:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} soc_etm_evt_st12_clr_reg_t;

/** Type of task_st0_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** gpio_task_ch0_set_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch0_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch0_set_st_clr:1;
        /** gpio_task_ch1_set_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch1_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch1_set_st_clr:1;
        /** gpio_task_ch2_set_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch2_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch2_set_st_clr:1;
        /** gpio_task_ch3_set_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch3_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch3_set_st_clr:1;
        /** gpio_task_ch4_set_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch4_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch4_set_st_clr:1;
        /** gpio_task_ch5_set_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch5_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch5_set_st_clr:1;
        /** gpio_task_ch6_set_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch6_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch6_set_st_clr:1;
        /** gpio_task_ch7_set_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch7_set trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch7_set_st_clr:1;
        /** gpio_task_ch0_clear_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch0_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch0_clear_st_clr:1;
        /** gpio_task_ch1_clear_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch1_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch1_clear_st_clr:1;
        /** gpio_task_ch2_clear_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch2_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch2_clear_st_clr:1;
        /** gpio_task_ch3_clear_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch3_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch3_clear_st_clr:1;
        /** gpio_task_ch4_clear_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch4_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch4_clear_st_clr:1;
        /** gpio_task_ch5_clear_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch5_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch5_clear_st_clr:1;
        /** gpio_task_ch6_clear_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch6_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch6_clear_st_clr:1;
        /** gpio_task_ch7_clear_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch7_clear trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch7_clear_st_clr:1;
        /** gpio_task_ch0_toggle_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch0_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch0_toggle_st_clr:1;
        /** gpio_task_ch1_toggle_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch1_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch1_toggle_st_clr:1;
        /** gpio_task_ch2_toggle_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch2_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch2_toggle_st_clr:1;
        /** gpio_task_ch3_toggle_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch3_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch3_toggle_st_clr:1;
        /** gpio_task_ch4_toggle_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch4_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch4_toggle_st_clr:1;
        /** gpio_task_ch5_toggle_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch5_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch5_toggle_st_clr:1;
        /** gpio_task_ch6_toggle_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch6_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch6_toggle_st_clr:1;
        /** gpio_task_ch7_toggle_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch7_toggle trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch7_toggle_st_clr:1;
        /** ledc0_task_timer0_res_update_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer0_res_update trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer0_res_update_st_clr:1;
        /** ledc0_task_timer1_res_update_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer1_res_update trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer1_res_update_st_clr:1;
        /** ledc0_task_timer2_res_update_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer2_res_update trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer2_res_update_st_clr:1;
        /** ledc0_task_timer3_res_update_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer3_res_update trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer3_res_update_st_clr:1;
        /** ledc0_task_duty_scale_update_ch0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch0_st_clr:1;
        /** ledc0_task_duty_scale_update_ch1_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch1_st_clr:1;
        /** ledc0_task_duty_scale_update_ch2_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch2_st_clr:1;
        /** ledc0_task_duty_scale_update_ch3_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch3_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st0_clr_reg_t;

/** Type of task_st1_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** ledc0_task_duty_scale_update_ch4_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch4_st_clr:1;
        /** ledc0_task_duty_scale_update_ch5_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch5_st_clr:1;
        /** ledc0_task_duty_scale_update_ch6_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch6_st_clr:1;
        /** ledc0_task_duty_scale_update_ch7_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC0_task_duty_scale_update_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_duty_scale_update_ch7_st_clr:1;
        /** ledc0_task_timer0_cap_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer0_cap trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer0_cap_st_clr:1;
        /** ledc0_task_timer1_cap_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer1_cap trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer1_cap_st_clr:1;
        /** ledc0_task_timer2_cap_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer2_cap trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer2_cap_st_clr:1;
        /** ledc0_task_timer3_cap_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer3_cap trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer3_cap_st_clr:1;
        /** ledc0_task_sig_out_dis_ch0_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch0_st_clr:1;
        /** ledc0_task_sig_out_dis_ch1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch1_st_clr:1;
        /** ledc0_task_sig_out_dis_ch2_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch2_st_clr:1;
        /** ledc0_task_sig_out_dis_ch3_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch3_st_clr:1;
        /** ledc0_task_sig_out_dis_ch4_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch4_st_clr:1;
        /** ledc0_task_sig_out_dis_ch5_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch5_st_clr:1;
        /** ledc0_task_sig_out_dis_ch6_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch6_st_clr:1;
        /** ledc0_task_sig_out_dis_ch7_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC0_task_sig_out_dis_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_sig_out_dis_ch7_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch0_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch0_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch1_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch1_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch2_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch2_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch3_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch3_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch4_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch4_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch5_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch5_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch6_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch6_st_clr:1;
        /** ledc0_task_ovf_cnt_rst_ch7_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear LEDC0_task_ovf_cnt_rst_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_ovf_cnt_rst_ch7_st_clr:1;
        /** ledc0_task_timer0_rst_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer0_rst trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer0_rst_st_clr:1;
        /** ledc0_task_timer1_rst_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer1_rst trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer1_rst_st_clr:1;
        /** ledc0_task_timer2_rst_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer2_rst trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer2_rst_st_clr:1;
        /** ledc0_task_timer3_rst_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer3_rst trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer3_rst_st_clr:1;
        /** ledc0_task_timer0_resume_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer0_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer0_resume_st_clr:1;
        /** ledc0_task_timer1_resume_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer1_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer1_resume_st_clr:1;
        /** ledc0_task_timer2_resume_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer2_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer2_resume_st_clr:1;
        /** ledc0_task_timer3_resume_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC0_task_timer3_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc0_task_timer3_resume_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st1_clr_reg_t;

