espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of task_st4_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** ledc1_task_timer0_resume_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer0_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer0_resume_st_clr:1;
        /** ledc1_task_timer1_resume_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer1_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer1_resume_st_clr:1;
        /** ledc1_task_timer2_resume_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer2_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer2_resume_st_clr:1;
        /** ledc1_task_timer3_resume_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer3_resume trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer3_resume_st_clr:1;
        /** ledc1_task_timer0_pause_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer0_pause trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer0_pause_st_clr:1;
        /** ledc1_task_timer1_pause_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer1_pause trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer1_pause_st_clr:1;
        /** ledc1_task_timer2_pause_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer2_pause trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer2_pause_st_clr:1;
        /** ledc1_task_timer3_pause_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC1_task_timer3_pause trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_timer3_pause_st_clr:1;
        /** ledc1_task_gamma_restart_ch0_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch0_st_clr:1;
        /** ledc1_task_gamma_restart_ch1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch1_st_clr:1;
        /** ledc1_task_gamma_restart_ch2_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch2_st_clr:1;
        /** ledc1_task_gamma_restart_ch3_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch3_st_clr:1;
        /** ledc1_task_gamma_restart_ch4_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch4_st_clr:1;
        /** ledc1_task_gamma_restart_ch5_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch5_st_clr:1;
        /** ledc1_task_gamma_restart_ch6_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch6_st_clr:1;
        /** ledc1_task_gamma_restart_ch7_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_restart_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_restart_ch7_st_clr:1;
        /** ledc1_task_gamma_pause_ch0_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch0_st_clr:1;
        /** ledc1_task_gamma_pause_ch1_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch1_st_clr:1;
        /** ledc1_task_gamma_pause_ch2_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch2_st_clr:1;
        /** ledc1_task_gamma_pause_ch3_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch3_st_clr:1;
        /** ledc1_task_gamma_pause_ch4_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch4_st_clr:1;
        /** ledc1_task_gamma_pause_ch5_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch5_st_clr:1;
        /** ledc1_task_gamma_pause_ch6_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch6_st_clr:1;
        /** ledc1_task_gamma_pause_ch7_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_pause_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_pause_ch7_st_clr:1;
        /** ledc1_task_gamma_resume_ch0_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch0_st_clr:1;
        /** ledc1_task_gamma_resume_ch1_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch1_st_clr:1;
        /** ledc1_task_gamma_resume_ch2_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch2_st_clr:1;
        /** ledc1_task_gamma_resume_ch3_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch3_st_clr:1;
        /** ledc1_task_gamma_resume_ch4_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch4_st_clr:1;
        /** ledc1_task_gamma_resume_ch5_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch5 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch5_st_clr:1;
        /** ledc1_task_gamma_resume_ch6_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch6 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch6_st_clr:1;
        /** ledc1_task_gamma_resume_ch7_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC1_task_gamma_resume_ch7 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ledc1_task_gamma_resume_ch7_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st4_clr_reg_t;

/** Type of task_st5_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** tg0_task_cnt_start_timer0_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_start_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_start_timer0_st_clr:1;
        /** tg0_task_alarm_start_timer0_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear TG0_task_alarm_start_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_alarm_start_timer0_st_clr:1;
        /** tg0_task_cnt_stop_timer0_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_stop_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_stop_timer0_st_clr:1;
        /** tg0_task_cnt_reload_timer0_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_reload_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_reload_timer0_st_clr:1;
        /** tg0_task_cnt_cap_timer0_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_cap_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_cap_timer0_st_clr:1;
        /** tg0_task_cnt_start_timer1_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_start_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_start_timer1_st_clr:1;
        /** tg0_task_alarm_start_timer1_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear TG0_task_alarm_start_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_alarm_start_timer1_st_clr:1;
        /** tg0_task_cnt_stop_timer1_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_stop_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_stop_timer1_st_clr:1;
        /** tg0_task_cnt_reload_timer1_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_reload_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_reload_timer1_st_clr:1;
        /** tg0_task_cnt_cap_timer1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_cap_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_cap_timer1_st_clr:1;
        /** tg1_task_cnt_start_timer0_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_start_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_start_timer0_st_clr:1;
        /** tg1_task_alarm_start_timer0_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear TG1_task_alarm_start_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_alarm_start_timer0_st_clr:1;
        /** tg1_task_cnt_stop_timer0_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_stop_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_stop_timer0_st_clr:1;
        /** tg1_task_cnt_reload_timer0_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_reload_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_reload_timer0_st_clr:1;
        /** tg1_task_cnt_cap_timer0_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_cap_timer0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_cap_timer0_st_clr:1;
        /** tg1_task_cnt_start_timer1_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_start_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_start_timer1_st_clr:1;
        /** tg1_task_alarm_start_timer1_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear TG1_task_alarm_start_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_alarm_start_timer1_st_clr:1;
        /** tg1_task_cnt_stop_timer1_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_stop_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_stop_timer1_st_clr:1;
        /** tg1_task_cnt_reload_timer1_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_reload_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_reload_timer1_st_clr:1;
        /** tg1_task_cnt_cap_timer1_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_cap_timer1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_cap_timer1_st_clr:1;
        /** mcpwm0_task_cmpr0_a_up_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr0_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_cmpr0_a_up_st_clr:1;
        /** mcpwm0_task_cmpr1_a_up_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr1_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_cmpr1_a_up_st_clr:1;
        /** mcpwm0_task_cmpr2_a_up_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr2_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_cmpr2_a_up_st_clr:1;
        /** mcpwm0_task_cmpr0_b_up_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr0_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_cmpr0_b_up_st_clr:1;
        /** mcpwm0_task_cmpr1_b_up_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr1_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_cmpr1_b_up_st_clr:1;
        /** mcpwm0_task_cmpr2_b_up_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr2_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_cmpr2_b_up_st_clr:1;
        /** mcpwm0_task_gen_stop_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_gen_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_gen_stop_st_clr:1;
        /** mcpwm0_task_timer0_syn_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer0_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_timer0_syn_st_clr:1;
        /** mcpwm0_task_timer1_syn_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer1_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_timer1_syn_st_clr:1;
        /** mcpwm0_task_timer2_syn_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer2_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_timer2_syn_st_clr:1;
        /** mcpwm0_task_timer0_period_up_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer0_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_timer0_period_up_st_clr:1;
        /** mcpwm0_task_timer1_period_up_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer1_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm0_task_timer1_period_up_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st5_clr_reg_t;

