espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of task_st7_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** mcpwm1_task_clr0_ost_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_clr0_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_clr0_ost_st_clr:1;
        /** mcpwm1_task_clr1_ost_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_clr1_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_clr1_ost_st_clr:1;
        /** mcpwm1_task_clr2_ost_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_clr2_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_clr2_ost_st_clr:1;
        /** mcpwm1_task_cap0_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cap0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_cap0_st_clr:1;
        /** mcpwm1_task_cap1_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cap1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_cap1_st_clr:1;
        /** mcpwm1_task_cap2_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cap2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_cap2_st_clr:1;
        /** mcpwm1_task_timer0_a_up_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer0_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_timer0_a_up_st_clr:1;
        /** mcpwm1_task_timer1_a_up_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer1_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_timer1_a_up_st_clr:1;
        /** mcpwm1_task_timer2_a_up_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer2_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_timer2_a_up_st_clr:1;
        /** mcpwm1_task_timer0_b_up_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer0_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_timer0_b_up_st_clr:1;
        /** mcpwm1_task_timer1_b_up_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer1_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_timer1_b_up_st_clr:1;
        /** mcpwm1_task_timer2_b_up_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer2_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm1_task_timer2_b_up_st_clr:1;
        /** mcpwm2_task_cmpr0_a_up_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cmpr0_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cmpr0_a_up_st_clr:1;
        /** mcpwm2_task_cmpr1_a_up_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cmpr1_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cmpr1_a_up_st_clr:1;
        /** mcpwm2_task_cmpr2_a_up_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cmpr2_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cmpr2_a_up_st_clr:1;
        /** mcpwm2_task_cmpr0_b_up_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cmpr0_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cmpr0_b_up_st_clr:1;
        /** mcpwm2_task_cmpr1_b_up_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cmpr1_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cmpr1_b_up_st_clr:1;
        /** mcpwm2_task_cmpr2_b_up_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cmpr2_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cmpr2_b_up_st_clr:1;
        /** mcpwm2_task_gen_stop_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_gen_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_gen_stop_st_clr:1;
        /** mcpwm2_task_timer0_syn_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer0_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer0_syn_st_clr:1;
        /** mcpwm2_task_timer1_syn_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer1_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer1_syn_st_clr:1;
        /** mcpwm2_task_timer2_syn_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer2_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer2_syn_st_clr:1;
        /** mcpwm2_task_timer0_period_up_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer0_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer0_period_up_st_clr:1;
        /** mcpwm2_task_timer1_period_up_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer1_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer1_period_up_st_clr:1;
        /** mcpwm2_task_timer2_period_up_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer2_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer2_period_up_st_clr:1;
        /** mcpwm2_task_tz0_ost_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_tz0_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_tz0_ost_st_clr:1;
        /** mcpwm2_task_tz1_ost_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_tz1_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_tz1_ost_st_clr:1;
        /** mcpwm2_task_tz2_ost_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_tz2_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_tz2_ost_st_clr:1;
        /** mcpwm2_task_clr0_ost_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_clr0_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_clr0_ost_st_clr:1;
        /** mcpwm2_task_clr1_ost_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_clr1_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_clr1_ost_st_clr:1;
        /** mcpwm2_task_clr2_ost_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_clr2_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_clr2_ost_st_clr:1;
        /** mcpwm2_task_cap0_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cap0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cap0_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st7_clr_reg_t;

/** Type of task_st8_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** mcpwm2_task_cap1_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cap1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cap1_st_clr:1;
        /** mcpwm2_task_cap2_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_cap2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_cap2_st_clr:1;
        /** mcpwm2_task_timer0_a_up_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer0_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer0_a_up_st_clr:1;
        /** mcpwm2_task_timer1_a_up_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer1_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer1_a_up_st_clr:1;
        /** mcpwm2_task_timer2_a_up_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer2_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer2_a_up_st_clr:1;
        /** mcpwm2_task_timer0_b_up_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer0_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer0_b_up_st_clr:1;
        /** mcpwm2_task_timer1_b_up_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer1_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer1_b_up_st_clr:1;
        /** mcpwm2_task_timer2_b_up_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear MCPWM2_task_timer2_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm2_task_timer2_b_up_st_clr:1;
        /** mcpwm3_task_cmpr0_a_up_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cmpr0_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cmpr0_a_up_st_clr:1;
        /** mcpwm3_task_cmpr1_a_up_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cmpr1_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cmpr1_a_up_st_clr:1;
        /** mcpwm3_task_cmpr2_a_up_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cmpr2_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cmpr2_a_up_st_clr:1;
        /** mcpwm3_task_cmpr0_b_up_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cmpr0_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cmpr0_b_up_st_clr:1;
        /** mcpwm3_task_cmpr1_b_up_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cmpr1_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cmpr1_b_up_st_clr:1;
        /** mcpwm3_task_cmpr2_b_up_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cmpr2_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cmpr2_b_up_st_clr:1;
        /** mcpwm3_task_gen_stop_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_gen_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_gen_stop_st_clr:1;
        /** mcpwm3_task_timer0_syn_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer0_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer0_syn_st_clr:1;
        /** mcpwm3_task_timer1_syn_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer1_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer1_syn_st_clr:1;
        /** mcpwm3_task_timer2_syn_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer2_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer2_syn_st_clr:1;
        /** mcpwm3_task_timer0_period_up_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer0_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer0_period_up_st_clr:1;
        /** mcpwm3_task_timer1_period_up_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer1_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer1_period_up_st_clr:1;
        /** mcpwm3_task_timer2_period_up_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer2_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer2_period_up_st_clr:1;
        /** mcpwm3_task_tz0_ost_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_tz0_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_tz0_ost_st_clr:1;
        /** mcpwm3_task_tz1_ost_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_tz1_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_tz1_ost_st_clr:1;
        /** mcpwm3_task_tz2_ost_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_tz2_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_tz2_ost_st_clr:1;
        /** mcpwm3_task_clr0_ost_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_clr0_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_clr0_ost_st_clr:1;
        /** mcpwm3_task_clr1_ost_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_clr1_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_clr1_ost_st_clr:1;
        /** mcpwm3_task_clr2_ost_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_clr2_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_clr2_ost_st_clr:1;
        /** mcpwm3_task_cap0_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cap0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cap0_st_clr:1;
        /** mcpwm3_task_cap1_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cap1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cap1_st_clr:1;
        /** mcpwm3_task_cap2_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_cap2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_cap2_st_clr:1;
        /** mcpwm3_task_timer0_a_up_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer0_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer0_a_up_st_clr:1;
        /** mcpwm3_task_timer1_a_up_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer1_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer1_a_up_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st8_clr_reg_t;

