espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of task_st9_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** mcpwm3_task_timer2_a_up_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer2_a_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer2_a_up_st_clr:1;
        /** mcpwm3_task_timer0_b_up_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer0_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer0_b_up_st_clr:1;
        /** mcpwm3_task_timer1_b_up_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer1_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer1_b_up_st_clr:1;
        /** mcpwm3_task_timer2_b_up_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear MCPWM3_task_timer2_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t mcpwm3_task_timer2_b_up_st_clr:1;
        /** adc_task_sample1_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear ADC_task_sample1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t adc_task_sample1_st_clr:1;
        /** adc_task_sample2_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear ADC_task_sample2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t adc_task_sample2_st_clr:1;
        /** adc_task_stop1_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear ADC_task_stop1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t adc_task_stop1_st_clr:1;
        /** adc_task_stop2_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ADC_task_stop2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t adc_task_stop2_st_clr:1;
        /** regdma_task_start0_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t regdma_task_start0_st_clr:1;
        /** regdma_task_start1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t regdma_task_start1_st_clr:1;
        /** regdma_task_start2_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t regdma_task_start2_st_clr:1;
        /** regdma_task_start3_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t regdma_task_start3_st_clr:1;
        /** tmpsnsr_task_start_sample_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear TMPSNSR_task_start_sample trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tmpsnsr_task_start_sample_st_clr:1;
        /** tmpsnsr_task_stop_sample_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear TMPSNSR_task_stop_sample trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t tmpsnsr_task_stop_sample_st_clr:1;
        /** i2s0_task_start_rx_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear I2S0_task_start_rx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s0_task_start_rx_st_clr:1;
        /** i2s0_task_start_tx_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear I2S0_task_start_tx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s0_task_start_tx_st_clr:1;
        /** i2s0_task_stop_rx_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear I2S0_task_stop_rx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s0_task_stop_rx_st_clr:1;
        /** i2s0_task_stop_tx_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear I2S0_task_stop_tx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s0_task_stop_tx_st_clr:1;
        /** i2s0_task_sync_check_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear I2S0_task_sync_check trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s0_task_sync_check_st_clr:1;
        /** i2s1_task_start_rx_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear I2S1_task_start_rx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s1_task_start_rx_st_clr:1;
        /** i2s1_task_start_tx_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear I2S1_task_start_tx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s1_task_start_tx_st_clr:1;
        /** i2s1_task_stop_rx_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear I2S1_task_stop_rx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s1_task_stop_rx_st_clr:1;
        /** i2s1_task_stop_tx_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear I2S1_task_stop_tx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s1_task_stop_tx_st_clr:1;
        /** i2s1_task_sync_check_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear I2S1_task_sync_check trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t i2s1_task_sync_check_st_clr:1;
        /** ulp_task_wakeup_cpu_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear ULP_task_wakeup_cpu trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ulp_task_wakeup_cpu_st_clr:1;
        /** ulp_task_int_cpu_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear ULP_task_int_cpu trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t ulp_task_int_cpu_st_clr:1;
        /** pmu_task_sleep_req_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear PMU_task_sleep_req trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pmu_task_sleep_req_st_clr:1;
        /** pdma_ahb_task_in_start_ch0_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_in_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_in_start_ch0_st_clr:1;
        /** pdma_ahb_task_in_start_ch1_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_in_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_in_start_ch1_st_clr:1;
        /** pdma_ahb_task_in_start_ch2_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_in_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_in_start_ch2_st_clr:1;
        /** pdma_ahb_task_in_start_ch3_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_in_start_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_in_start_ch3_st_clr:1;
        /** pdma_ahb_task_in_start_ch4_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_in_start_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_in_start_ch4_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st9_clr_reg_t;

