espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of task_st10_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** pdma_ahb_task_out_start_ch0_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_out_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_out_start_ch0_st_clr:1;
        /** pdma_ahb_task_out_start_ch1_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_out_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_out_start_ch1_st_clr:1;
        /** pdma_ahb_task_out_start_ch2_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_out_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_out_start_ch2_st_clr:1;
        /** pdma_ahb_task_out_start_ch3_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_out_start_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_out_start_ch3_st_clr:1;
        /** pdma_ahb_task_out_start_ch4_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear PDMA_AHB_task_out_start_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_ahb_task_out_start_ch4_st_clr:1;
        /** lp_pdma_ahb_task_in_start_ch0_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LP_PDMA_AHB_task_in_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t lp_pdma_ahb_task_in_start_ch0_st_clr:1;
        /** lp_pdma_ahb_task_in_start_ch1_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LP_PDMA_AHB_task_in_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t lp_pdma_ahb_task_in_start_ch1_st_clr:1;
        /** lp_pdma_ahb_task_out_start_ch0_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LP_PDMA_AHB_task_out_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t lp_pdma_ahb_task_out_start_ch0_st_clr:1;
        /** lp_pdma_ahb_task_out_start_ch1_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LP_PDMA_AHB_task_out_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t lp_pdma_ahb_task_out_start_ch1_st_clr:1;
        /** pdma_axi_task_in_start_ch0_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear PDMA_AXI_task_in_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_axi_task_in_start_ch0_st_clr:1;
        /** pdma_axi_task_in_start_ch1_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear PDMA_AXI_task_in_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_axi_task_in_start_ch1_st_clr:1;
        /** pdma_axi_task_in_start_ch2_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear PDMA_AXI_task_in_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_axi_task_in_start_ch2_st_clr:1;
        /** pdma_axi_task_out_start_ch0_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear PDMA_AXI_task_out_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_axi_task_out_start_ch0_st_clr:1;
        /** pdma_axi_task_out_start_ch1_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear PDMA_AXI_task_out_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_axi_task_out_start_ch1_st_clr:1;
        /** pdma_axi_task_out_start_ch2_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear PDMA_AXI_task_out_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t pdma_axi_task_out_start_ch2_st_clr:1;
        /** dma2d_task_in_start_ch0_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear DMA2D_task_in_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_in_start_ch0_st_clr:1;
        /** dma2d_task_in_start_ch1_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear DMA2D_task_in_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_in_start_ch1_st_clr:1;
        /** dma2d_task_in_start_ch2_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear DMA2D_task_in_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_in_start_ch2_st_clr:1;
        /** dma2d_task_in_dscr_ready_ch0_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_in_dscr_ready_ch0_st_clr:1;
        /** dma2d_task_in_dscr_ready_ch1_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_in_dscr_ready_ch1_st_clr:1;
        /** dma2d_task_in_dscr_ready_ch2_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_in_dscr_ready_ch2_st_clr:1;
        /** dma2d_task_out_start_ch0_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_start_ch0_st_clr:1;
        /** dma2d_task_out_start_ch1_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_start_ch1_st_clr:1;
        /** dma2d_task_out_start_ch2_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_start_ch2_st_clr:1;
        /** dma2d_task_out_start_ch3_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_start_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_start_ch3_st_clr:1;
        /** dma2d_task_out_dscr_ready_ch0_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_dscr_ready_ch0_st_clr:1;
        /** dma2d_task_out_dscr_ready_ch1_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_dscr_ready_ch1_st_clr:1;
        /** dma2d_task_out_dscr_ready_ch2_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_dscr_ready_ch2_st_clr:1;
        /** dma2d_task_out_dscr_ready_ch3_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t dma2d_task_out_dscr_ready_ch3_st_clr:1;
        /** modem_task_g0_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear MODEM_task_g0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_task_g0_st_clr:1;
        /** modem_task_g1_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear MODEM_task_g1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_task_g1_st_clr:1;
        /** modem_task_g2_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear MODEM_task_g2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_task_g2_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st10_clr_reg_t;

/** Type of task_st11_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** modem_task_g3_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear MODEM_task_g3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t modem_task_g3_st_clr:1;
        /** cordic_task_cal_start_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear CORDIC_task_cal_start trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t cordic_task_cal_start_st_clr:1;
        /** zero_det_task_start_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear ZERO_DET_task_start trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t zero_det_task_start_st_clr:1;
        /** systimer_task_cnt_upd0_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear SYSTIMER_task_cnt_upd0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t systimer_task_cnt_upd0_st_clr:1;
        /** systimer_task_cnt_upd1_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear SYSTIMER_task_cnt_upd1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t systimer_task_cnt_upd1_st_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} soc_etm_task_st11_clr_reg_t;

