espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_struct.h
/** Type of clk_en register
 *  ETM clock enable register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.
         *  0: Open the clock gate only when application writes registers
         *  1: Force open the clock gate for register
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} soc_etm_clk_en_reg_t;


/** Group: Version Register */
/** Type of date register
 *  ETM date register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 38801984;
         *  Configures the version.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} soc_etm_date_reg_t;


typedef struct soc_etm_dev_t {
    volatile soc_etm_ch_ena_ad0_reg_t ch_ena_ad0;
    volatile soc_etm_ch_ena_ad0_set_reg_t ch_ena_ad0_set;
    volatile soc_etm_ch_ena_ad0_clr_reg_t ch_ena_ad0_clr;
    volatile soc_etm_ch_ena_ad1_reg_t ch_ena_ad1;
    volatile soc_etm_ch_ena_ad1_set_reg_t ch_ena_ad1_set;
    volatile soc_etm_ch_ena_ad1_clr_reg_t ch_ena_ad1_clr;
    volatile struct {
        soc_etm_chn_evt_id_reg_t eid;
        soc_etm_chn_task_id_reg_t tid;
    } channel[50];
    volatile soc_etm_evt_st0_reg_t evt_st0;
    volatile soc_etm_evt_st0_clr_reg_t evt_st0_clr;
    volatile soc_etm_evt_st1_reg_t evt_st1;
    volatile soc_etm_evt_st1_clr_reg_t evt_st1_clr;
    volatile soc_etm_evt_st2_reg_t evt_st2;
    volatile soc_etm_evt_st2_clr_reg_t evt_st2_clr;
    volatile soc_etm_evt_st3_reg_t evt_st3;
    volatile soc_etm_evt_st3_clr_reg_t evt_st3_clr;
    volatile soc_etm_evt_st4_reg_t evt_st4;
    volatile soc_etm_evt_st4_clr_reg_t evt_st4_clr;
    volatile soc_etm_evt_st5_reg_t evt_st5;
    volatile soc_etm_evt_st5_clr_reg_t evt_st5_clr;
    volatile soc_etm_evt_st6_reg_t evt_st6;
    volatile soc_etm_evt_st6_clr_reg_t evt_st6_clr;
    volatile soc_etm_evt_st7_reg_t evt_st7;
    volatile soc_etm_evt_st7_clr_reg_t evt_st7_clr;
    volatile soc_etm_evt_st8_reg_t evt_st8;
    volatile soc_etm_evt_st8_clr_reg_t evt_st8_clr;
    volatile soc_etm_evt_st9_reg_t evt_st9;
    volatile soc_etm_evt_st9_clr_reg_t evt_st9_clr;
    volatile soc_etm_evt_st10_reg_t evt_st10;
    volatile soc_etm_evt_st10_clr_reg_t evt_st10_clr;
    volatile soc_etm_evt_st11_reg_t evt_st11;
    volatile soc_etm_evt_st11_clr_reg_t evt_st11_clr;
    volatile soc_etm_evt_st12_reg_t evt_st12;
    volatile soc_etm_evt_st12_clr_reg_t evt_st12_clr;
    volatile soc_etm_task_st0_reg_t task_st0;
    volatile soc_etm_task_st0_clr_reg_t task_st0_clr;
    volatile soc_etm_task_st1_reg_t task_st1;
    volatile soc_etm_task_st1_clr_reg_t task_st1_clr;
    volatile soc_etm_task_st2_reg_t task_st2;
    volatile soc_etm_task_st2_clr_reg_t task_st2_clr;
    volatile soc_etm_task_st3_reg_t task_st3;
    volatile soc_etm_task_st3_clr_reg_t task_st3_clr;
    volatile soc_etm_task_st4_reg_t task_st4;
    volatile soc_etm_task_st4_clr_reg_t task_st4_clr;
    volatile soc_etm_task_st5_reg_t task_st5;
    volatile soc_etm_task_st5_clr_reg_t task_st5_clr;
    volatile soc_etm_task_st6_reg_t task_st6;
    volatile soc_etm_task_st6_clr_reg_t task_st6_clr;
    volatile soc_etm_task_st7_reg_t task_st7;
    volatile soc_etm_task_st7_clr_reg_t task_st7_clr;
    volatile soc_etm_task_st8_reg_t task_st8;
    volatile soc_etm_task_st8_clr_reg_t task_st8_clr;
    volatile soc_etm_task_st9_reg_t task_st9;
    volatile soc_etm_task_st9_clr_reg_t task_st9_clr;
    volatile soc_etm_task_st10_reg_t task_st10;
    volatile soc_etm_task_st10_clr_reg_t task_st10_clr;
    volatile soc_etm_task_st11_reg_t task_st11;
    volatile soc_etm_task_st11_clr_reg_t task_st11_clr;
    volatile soc_etm_clk_en_reg_t clk_en;
    volatile soc_etm_date_reg_t date;
} soc_etm_dev_t;

extern soc_etm_dev_t SOC_ETM;

#ifndef __cplusplus
_Static_assert(sizeof(soc_etm_dev_t) == 0x278, "Invalid size of soc_etm_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
